leetcode_715_range_module.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 715. Range Module</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 715. Range Module</h1>
<p>
<a href="https://leetcode.com/problems/range-module/">Problem Statement</a>
</p>

<ul class="org-ul">
<li><a href="mistake_bug_caused_by_debug_code.html#ID-00CC89B4-340B-4219-9CF4-837F558947B4">Mistake: Bug caused by debug code</a></li>

<li><a href="blackbox_this_is_a_variation_of_a_classic_problem.html#ID-EEDBE877-7C4A-4D0B-BA6B-EFDF9288B78C">Blackbox: This is a variation of a classic problem</a>: <a href="segment_tree_from_one_dimensional_array.html#ID-8564CEB1-3E95-4A34-B888-0BCE6D6504B8">Lazy Segment Tree</a>.</li>
</ul>

<p>
The solution with <a href="segment_tree_from_one_dimensional_array.html#ID-8564CEB1-3E95-4A34-B888-0BCE6D6504B8">Lazy Segment Tree</a> has time complexity of \(O(n \log m)\) where \(m\) is the maximum value in the interval, and space complexity of \(O(n)\):
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">RangeModule</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, left=1, right=10**9, full=<span style="font-weight: bold; text-decoration: underline;">False</span>):
        <span style="font-weight: bold;">self</span>.left = left
        <span style="font-weight: bold;">self</span>.mid = left + (right - left) // 2
        <span style="font-weight: bold;">self</span>.right = right
        <span style="font-weight: bold;">self</span>.left_child = <span style="font-weight: bold;">self</span>.right_child = <span style="font-weight: bold; text-decoration: underline;">None</span>
        <span style="font-weight: bold;">self</span>.full = full

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">addRange</span>(<span style="font-weight: bold;">self</span>, left: <span style="font-weight: bold;">int</span>, right: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold; text-decoration: underline;">None</span>:
        <span style="font-weight: bold;">self</span>._update(left, right - 1, <span style="font-weight: bold; text-decoration: underline;">True</span>)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">removeRange</span>(<span style="font-weight: bold;">self</span>, left: <span style="font-weight: bold;">int</span>, right: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold; text-decoration: underline;">None</span>:
        <span style="font-weight: bold;">self</span>._update(left, right - 1, <span style="font-weight: bold; text-decoration: underline;">False</span>)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">queryRange</span>(<span style="font-weight: bold;">self</span>, left: <span style="font-weight: bold;">int</span>, right: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">bool</span>:
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>._query(left, right - 1)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">_query</span>(<span style="font-weight: bold;">self</span>, left: <span style="font-weight: bold;">int</span>, right: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">bool</span>:
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.right &lt; left <span style="font-weight: bold;">or</span> right &lt; <span style="font-weight: bold;">self</span>.left:
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">True</span>

        <span style="font-weight: bold;">self</span>._extend()
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.full <span style="font-weight: bold;">or</span> left &lt;= <span style="font-weight: bold;">self</span>.left &lt;= <span style="font-weight: bold;">self</span>.right &lt;= right:
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.full

        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.left_child._query(left, right) <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">self</span>.right_child._query(
            left, right
        )

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">_update</span>(<span style="font-weight: bold;">self</span>, left: <span style="font-weight: bold;">int</span>, right: <span style="font-weight: bold;">int</span>, value: <span style="font-weight: bold;">bool</span>) -&gt; <span style="font-weight: bold; text-decoration: underline;">None</span>:
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.right &lt; left <span style="font-weight: bold;">or</span> right &lt; <span style="font-weight: bold;">self</span>.left:
            <span style="font-weight: bold;">return</span>
        <span style="font-weight: bold;">if</span> left &lt;= <span style="font-weight: bold;">self</span>.left &lt;= <span style="font-weight: bold;">self</span>.right &lt;= right:
            <span style="font-weight: bold;">self</span>.left_child = <span style="font-weight: bold; text-decoration: underline;">None</span>
            <span style="font-weight: bold;">self</span>.right_child = <span style="font-weight: bold; text-decoration: underline;">None</span>
            <span style="font-weight: bold;">self</span>.full = value
            <span style="font-weight: bold;">return</span>
        <span style="font-weight: bold;">self</span>._extend()
        <span style="font-weight: bold;">self</span>.left_child._update(left, right, value)
        <span style="font-weight: bold;">self</span>.right_child._update(left, right, value)
        <span style="font-weight: bold;">self</span>.full = <span style="font-weight: bold;">self</span>.left_child.full <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">self</span>.right_child.full

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">_extend</span>(<span style="font-weight: bold;">self</span>) -&gt; <span style="font-weight: bold; text-decoration: underline;">None</span>:
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.left_child <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span> <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">self</span>.left &lt; <span style="font-weight: bold;">self</span>.right:
            m = <span style="font-weight: bold;">self</span>.left + (<span style="font-weight: bold;">self</span>.right - <span style="font-weight: bold;">self</span>.left) // 2
            <span style="font-weight: bold;">self</span>.left_child = RangeModule(<span style="font-weight: bold;">self</span>.left, m, <span style="font-weight: bold;">self</span>.full)
            <span style="font-weight: bold;">self</span>.right_child = RangeModule(m + 1, <span style="font-weight: bold;">self</span>.right, <span style="font-weight: bold;">self</span>.full)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">_print</span>(<span style="font-weight: bold;">self</span>, level=0):
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">" "</span> * level, <span style="font-weight: bold;">self</span>.left, <span style="font-weight: bold;">self</span>.right, <span style="font-weight: bold;">self</span>.full)
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.left_child:
            <span style="font-weight: bold;">self</span>.left_child._print(level + 1)
            <span style="font-weight: bold;">self</span>.right_child._print(level + 1)


<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Your RangeModule object will be instantiated and called as such:</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">obj = RangeModule()</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">obj.addRange(left,right)</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">param_2 = obj.queryRange(left,right)</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">obj.removeRange(left,right)</span>
</pre>
</div>


<div id="outline-container-org453fc0b" class="outline-2">
<h2 id="org453fc0b"><span class="todo TODO">TODO</span> Write solution using array of indexes</h2>
<div class="outline-text-2" id="text-org453fc0b">
<p>
The idea is to represent intervals in an array where even number are start of intervals and odd indexes are end of intervals.
</p>

<pre class="example" id="org0a9c288">
["RangeModule","addRange","removeRange","queryRange","queryRange","queryRange"]
[[],[10,20],[14,16],[10,14],[13,15],[16,17]]
["RangeModule","addRange","addRange","removeRange","queryRange","queryRange","removeRange","removeRange","removeRange","removeRange","removeRange","queryRange","removeRange","addRange","removeRange","addRange","queryRange","queryRange","addRange","addRange","queryRange","removeRange","queryRange","addRange","queryRange","removeRange","removeRange","addRange","addRange","removeRange","removeRange","removeRange","addRange","addRange","queryRange","queryRange","queryRange","queryRange","queryRange","removeRange","removeRange","queryRange","addRange","addRange","addRange","queryRange","addRange","addRange","removeRange","addRange","queryRange","removeRange","addRange","queryRange","addRange","addRange","addRange","queryRange","addRange","queryRange","removeRange","removeRange","removeRange","removeRange","queryRange","removeRange","queryRange","queryRange","removeRange","queryRange","addRange","addRange","queryRange","removeRange","removeRange","queryRange","addRange","removeRange","removeRange","addRange","addRange","addRange","queryRange","queryRange","addRange","queryRange","removeRange","queryRange","removeRange","addRange","queryRange"]
[[],[55,62],[1,29],[18,49],[6,98],[59,71],[40,45],[4,58],[57,69],[20,30],[1,40],[73,93],[32,93],[38,100],[50,64],[26,72],[8,74],[15,53],[44,85],[10,71],[54,70],[10,45],[30,66],[47,98],[1,7],[44,78],[31,49],[62,63],[49,88],[47,72],[8,50],[49,79],[31,47],[54,87],[77,78],[59,100],[8,9],[50,51],[67,93],[25,86],[8,92],[31,87],[90,95],[28,56],[10,42],[27,34],[75,81],[17,63],[78,90],[9,18],[51,74],[20,54],[35,72],[2,29],[28,41],[17,95],[73,75],[34,43],[57,96],[51,72],[21,67],[40,73],[14,26],[71,86],[34,41],[10,25],[27,68],[18,32],[30,31],[45,61],[64,66],[18,93],[13,21],[13,46],[56,99],[6,93],[25,36],[27,88],[82,83],[30,71],[31,73],[10,41],[71,72],[9,56],[22,76],[38,74],[2,77],[33,61],[74,75],[11,43],[27,75]]
</pre>
</div>
</div>
</div>
</body>
</html>